{
    "name": "Abhishek Singh",
    "contact": {
      "phone": "+919817036557",
      "email": "abhisheksinghrajput5888@gmail.com",
      "github": "Github",
      "linkedin": "LinkedIn",
      "website": "http://abhishekdev.com",
      "leetcode": "Leetcode"
    },
    "education": [
      {
        "institution": "Guru Jambheshwar University of Science and Technology, Hisar",
        "degree": "B.Tech Computer Science and Engineering",
        "year": 2025,
        "cgpa": 6.77
      },
      {
        "institution": "Government Senior Secondary School, Jhajjar",
        "year": 2020,
        "board": "Board of School Education Haryana",
        "percentage": 90
      },
      {
        "institution": "Shree Sanatan Dharama Senior Secondary School, Jhajjar",
        "year": 2018,
        "board": "Board of School Education Haryana",
        "percentage": 91.2
      }
    ],
    "personalProjects": [
      {
        "name": "Sparkify",
        "description": "Sparkify is a full-stack Tinder-like application built using the MERN stack. It features swipe-based interactions, real-time chat with matches, advanced search functionality, and a seamless user experience. With a robust backend and optimized matching algorithms, Sparkify redefines the way users connect, making it intuitive, engaging, and efficient."
      },
      {
        "name": "Pdiary",
        "description": "A full-stack web application built with the MERN stack that allows users to track weekly entries with text and images. Users can save, edit, and delete their weekly data to reflect on their year. It features user authentication, Cloudinary for seamless image upload and storage, and a responsive design optimized for both mobile and desktop devices."
      },
      {
        "name": "Play Paytm",
        "description": "I developed a project play paytm using Node.js, Express.js, MongoDB and React. In this project users can: Sign Up and get a random balance in their account. Transfer Money to any pre-registered user. Track Transactions with backend logic ensuring the process happens seamlessly. The highlight: I implemented token-based authentication for secure login/signup and used database session to ensure reliability and consistency during money transfers."
      }
    ],
    "technicalSkills": {
      "programmingLanguages": ["C", "C++", "JavaScript", "Python"],
      "technologies": ["HTML", "CSS", "Node.js", "Express.js", "MongoDB", "React.js", "REST API", "TailwindCSS", "Bootstrap"],
      "tools": ["Git", "GitHub", "VSCode", "Postman"],
      "courses": ["DSA", "OOP’S", "DBMS", "CN", "OS"]
    },
    "certificationAndExperience": [
      {
        "role": "Web Developer Intern",
        "company": "Octanet",
        "description": "Designed and developed a responsive landing page for a new dance school, focusing on user experience, SEO optimization, and performance. Collaborated with stakeholders to gather requirements and implemented interactive features using HTML, CSS, and JavaScript."
      },
      {
        "certification": "Full Stack Web Developer Certification",
        "platform": "Udemy",
        "description": "Completing the Full Stack Web Development certification from Udemy was an enriching experience. I gained comprehensive knowledge of front-end and back-end technologies, and hands-on projects solidified my skills. This course has equipped me with the confidence and expertise to tackle real-world web development challenges."
      }
    ]
  }
  